<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest OpenOffice.</string>
	<key>Identifier</key>
	<string>com.ebf.download.OpenOffice</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>OpenOffice</string>
		<key>LANGUAGE</key>
		<string>en-US</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.9</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Comment</key>
			<string>Get download link from SourceForge project RSS feed</string>
			<key>Processor</key>
			<string>URLTextSearcher</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>https://sourceforge.net/projects/openofficeorg.mirror/rss?limit=700</string>
				<key>re_pattern</key>
				<string>(?P&lt;url&gt;https://sourceforge.net/projects/openofficeorg.mirror/files/(?P&lt;version&gt;[0-9\.]+)/binaries/%LANGUAGE%/(?P&lt;filename&gt;Apache_OpenOffice_[0-9\.]+_MacOS_x86-64_install_%LANGUAGE%\.dmg)/download)</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>CHECK_FILESIZE_ONLY</key>
				<true />
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
